Revit.Elements.ModelCurve
A Revit ModelCurve

Revit.Elements.ModelCurve.#ctor(Autodesk.Revit.DB.ModelCurve)
Construct a model curve from the document.  The result is Dynamo owned
curve:

Revit.Elements.ModelCurve.#ctor(Autodesk.Revit.DB.Curve,System.Boolean)
Internal constructor for ModelCurve
crv:
makeReferenceCurve:

Revit.Elements.ModelCurve.InitModelCurve(Autodesk.Revit.DB.ModelCurve)
Initialize a ModelCurve element
curve:

Revit.Elements.ModelCurve.InitModelCurve(Autodesk.Revit.DB.Curve,System.Boolean)
Initialize a ModelCurve element
crv:
makeReferenceCurve:

Revit.Elements.ModelCurve.InternalSetSketchPlaneFromCurve(Autodesk.Revit.DB.Curve)
Set the curve internally.  Returns false if this method failed to set the curve
c:
Returns:

Revit.Elements.ModelCurve.ByCurve(Autodesk.DesignScript.Geometry.Curve)
Construct a Revit ModelCurve element from a Curve
curve:
Returns:

Revit.Elements.ModelCurve.ReferenceCurveByCurve(Autodesk.DesignScript.Geometry.Curve)
Construct a Revit ModelCurve element from a Curve
curve:
Returns:

Revit.Elements.ModelCurve.FromExisting(Autodesk.Revit.DB.ModelCurve,System.Boolean)
Construct a Revit ModelCurve element from an existing element.  The result is Dynamo owned.
modelCurve:
isRevitOwned:
Returns: